const recipes = [
  {
    title: "בראוניז פרווה עם חמאת בוטנים",
    image: "../images/בראוניז.jpg",
    ingredients: [
      "150 ג' שוקולד מריר (חבילה וחצי)", "150 מ\"ל שמן (קצת יותר מחצי כוס)",
      "200 ג' סוכר (כוס)", "4 ביצים L", "60 מ\"ל שמנת מתוקה / בישול / ריץ / צמחית (רבע כוס)",
      "2 כפות שטוחות אבקת קקאו", "קורט מלח (כמה שנתפס בין שתי אצבעות)", "140 ג' קמח רגיל (כוס)",
      "2 כפות גדושות חמאת בוטנים"],
    steps: [
      "שוברים את השוקולד לקוביות, שמים בקערה יחד עם השמן וממיסים כדקה במיקרו (לכל מיקרו יש את הזמן שלו). ברגע שהשוקולד רך – מוציאים ומערבבים לקרם אחיד וחלק ללא גושים קטנים.",
      "בעזרת מטרפה טורפים כדקה את הביצים והסוכר, ומוסיפים לשוקולד תוך כדי ערבוב מהיר ונמרץ. מוסיפים את השמנת, הקקאו, המלח ומסיימים עם הקמח. מערבבים לעיסה אחידה וחלקה.",
      "מחממים תנור ל־180 מעלות. משמנים תבנית או מניחים נייר אפייה, מעבירים את עיסת הבראוניז לתבנית ומשטחים באופן שווה.",
      "שמים בקערה 2 כפות גדושות חמאת בוטנים, מכניסים למיקרו בעוצמה מלאה כ־15 שניות, ומערבבים לבלילה חלקה ונוזלית. אם חמאת הבוטנים נוזלית מהקופסה – אין צורך לחמם.",
      "בעזרת כף מטפטפים חמאת בוטנים מעל הבראוניז לפי הסגנון הרצוי. בעזרת סכין מערבבים מעט ליצירת צורות יפות. אופים כ־30 דקות או עד שקיסם יוצא עם פירורים לחים.",
      "מומלץ לקרר מספר שעות לפני שחותכים לקוביות. ביום חם אין כמו לאכול בראוניז קר."
    ]
  },
  {
    title: "מאפינס תפוחים ושיבולת שועל מופחת סוכר",
    image: "../images/מאפינס.jpg",
    ingredients: [
      "2 ביצים L",
      "80 מ\"ל שמן (שליש כוס)",
      "שליש כוס סוכר חום דמררה",
      "1/3 כוס סירופ מייפל",
      "3 תפוחים מקולפים חתוכים לקוביות",
      "כוס שיבולת שועל דקה (קוואקר)",
      "140 ג' קמח רגיל (כוס)",
      "כפית קינמון",
      "כפית אבקת אפייה"
    ],
    steps: [
      "לחמם תנור ל־180 מעלות ולשמן תבנית שקעים עם ספריי שמן.",
      "בעזרת מטרפה לטרוף ביצים, סוכר וסירופ מייפל במשך כמה שניות. להוסיף את השמן וקוביות התפוחים, לערבב ולהוסיף את הקמח, שיבולת שועל, אבקת אפייה ולערבב לתערובת אחידה.",
      "למלא את השקעים ולאפות כ־25 דקות. מומלץ לנעוץ קיסם במרכז המאפינס ולוודא שהוא יוצא נקי.",
      "תנו למאפינס להתקרר ותיהנו מהריח והטעם המשגע 😊"
    ]
  },
  {
    title: "עוגת גבינה מנוקדת",
    image: "../images/עוגת גבינה מנוקדת.jpg",
    ingredients: [
      "750 ג' גבינה לבנה 5%",
      "200 ג' שמנת חמוצה",
      "150 ג' יוגורט במתיקות מעודנת",
      "250 ג' סוכר (כוס ורבע)",
      "140 ג' קמח (כוס)",
      "40 ג' אינסטנט פודינג וניל (2 כפות)",
      "3 ביצים גדולות",
      "2 כפות שטוחות אבקת קקאו"
    ],
    steps: [
      "לחמם תנור ל־180 מעלות",
      "לערבב את הגבינה, היוגורט, השמנת והסוכר",
      "להוסיף את הביצים, הקמח ואינסטנט וניל ולערבב לבלילה אחידה",
      "להוציא כ־4–6 כפות בלילה, לערבב עם הקקאו ולשמור בצד",
      "לשטח את הבלילה הבהירה בתבנית, לזלף את הכהה כנקודות מעל",
      "לאפות כ־40 דקות עד שהעוגה מתייצבת",
      "לקרר כמה שעות לפני שחותכים – עדיף להכין יום מראש"
    ]
  },
  {
    title: "עוגת מייפל רכה ועסיסית ירקות",
    image: "../images/עוגת מייפל.jpg",
    ingredients: [
      "3 ביצים גדולות / 4 ביצים L",
      "200 ג' סוכר (כוס)",
      "180 מ\"ל שמן (3/4 כוס)",
      "240 מ\"ל תה (כוס)",
      "כפית קינמון",
      "כפית שטוחה אבקת סודה לשתייה",
      "280 ג' קמח (2 כוסות)",
      "2 כפיות אבקת אפייה",
      "סירופ מייפל (לקישוט / לציפוי)"
    ],
    steps: [
      "להכין כוס תה כמו שאוהבים, להשאיר את התיון 5 דקות, להוציא ולקרר את התה 15 דקות",
      "לחמם תנור ל־180 מעלות",
      "במיקסר (או ידנית) לערבב ביצים, סוכר, תה, שמן ואז את שאר המצרכים עד לקבלת בלילה נוזלית ואחידה",
      "להעביר לתבנית משומנת ולאפות כ־45–50 דקות או עד שקיסם יוצא יבש",
      "כשהעוגה יוצאת מהתנור, להזליף עליה כחצי כוס סירופ מייפל בנדיבות"
    ]

  }
];

function openModal(index) {
  const recipe = recipes[index];
  document.getElementById("modal-title").textContent = recipe.title;
  document.getElementById("modal-image").src = recipe.image;

  const ingredientsList = document.getElementById("modal-ingredients");
  ingredientsList.innerHTML = "";
  recipe.ingredients.forEach(ing => {
    const li = document.createElement("li");
    li.textContent = ing;
    ingredientsList.appendChild(li);
  });

  const stepsList = document.getElementById("modal-steps");
  stepsList.innerHTML = "";
  recipe.steps.forEach(step => {
    const li = document.createElement("li");
    li.textContent = step;
    stepsList.appendChild(li);
  });

  document.getElementById("recipe-modal").style.display = "block";
}

function closeModal() {
  document.getElementById("recipe-modal").style.display = "none";
}
